Repository: dynamicexpresso/DynamicExpresso
Catalog: src/DynamicExpresso.Core/Resources/ErrorMessages.*.resx
Languages: de

# AmbiguousBinaryOperatorInvocation
source: Ambiguous invocation of user defined operator '{0}' in types '{1}' and '{2}'
de: Mehrdeutiger Aufruf des Nutzer-definierten Opeators '{0}' mit Typen '{1}' und '{2}'

# AmbiguousConstructorInvocation
source: Ambiguous invocation of constructor in type '{0}'
de: Mehrdeutiger Aufruf eines Konstruktors des Typen '{0}'

# AmbiguousDelegateInvocation
source: Ambiguous invocation of delegate (multiple overloads found)
de: Mehrdeutiger Aufruf eines Delegats (mehrere Überladungen gefunden)

# AmbiguousIndexerInvocation
source: Ambiguous invocation of indexer in type '{0}'
de: Mehrdeutiger Aufruf eines Indexers des Typen '{0}'

# AmbiguousMethodInvocation
source: Ambiguous invocation of method '{0}' in type '{1}'
de: Mehrdeutiger Aufruf der Methode '{0}' mit Typen '{1}'

# AmbiguousUnaryOperatorInvocation
source: Ambiguous invocation of user defined operator '{0}' in type '{1}'
de: Mehrdeutiger Aufruf des Nutzer-definierten Operators '{0}' mit Typen '{1}'

# ArgsIncompatibleWithDelegate
source: Argument list incompatible with delegate expression
de: Argument-Liste inkompatibel mit Delegaten-Ausdruck

# ArgsIncompatibleWithLambda
source: Argument list incompatible with lambda expression
de: Argument-Liste inkompatibel mit Lambda-Ausdruck

# BothTypesConvertToOther
source: Both of the types '{0}' and '{1}' convert to the other
de: Beide Typen '{0}' und '{1}' können zueinander konvertiert werden

# CannotConvertValue
source: A value of type '{0}' cannot be converted to type '{1}'
de: Ein Wert mit Typ '{0}' kann nicht zum Typ '{1}' konvertiert werden

# CloseBracketOrCommaExpected
source: ']' or ',' expected
de: ']' oder ',' erwartet

# CloseCurlyBracketExpected
source: '}}' expected
de: '}}' erwartet

# CloseParenOrCommaExpected
source: ')' or ',' expected
de: ')' oder ',' erwartet

# CloseParenOrOperatorExpected
source: ')' or operator expected
de: ')' oder Operator erwartet

# CloseTypeArgumentListExpected
source: '>' expected
de: '>' erwartet

# CollectionInitializationNotSupported
source: Cannot initialize type '{0}' with a collection initializer because it does not implement '{1}'
de: Der Typ '{0}' kann nicht mit einem Auflistungsinitialisierer initialisiert werden, da es '{1}' nicht implementiert

# ColonExpected
source: ':' expected
de: ':' erwartet

source: Digit expected
de: Ziffer erwartet

# DotOrOpenParenExpected
source: '.' or '(' expected
de: '.' oder '(' erwartet

# EqualExpected
source: '=' expected
de: '=' erwartet

source: Expression expected
de: Ausdruck erwartet

source: Expression must be writable
de: Ausdruck muss schreibbar sein

# FirstExprMustBeBool
source: The first expression must be of type 'Boolean'
de: Der erste Ausdruck muss vom Typ 'Boolean' sein

# Format
source: {0} (at index {1}).
de: {0} (an Stelle {1})

source: Identifier expected
de: Bezeichner erwartet

# IncompatibleOperand
source: Operator '{0}' incompatible with operand type '{1}'
de: Operator '{0}' ist nicht kompatibel mit Operand von Typ '{1}'

# IncompatibleOperands
source: Operator '{0}' incompatible with operand types '{1}' and '{2}'
de: Operator '{0}' ist nicht kompatibel mit Operanden von Typen '{1}' und '{2}'

source: Incorrect number of indexes
de: Falsche Anzahl an Indexen

# InvalidCharacter
source: Syntax error '{0}'
de: Syntax Fehler '{0}'

# InvalidCharacterLiteral
source: Character literal must contain exactly one character
de: Zeichenliteral muss genau ein Zeichen beinhalten

# InvalidEscapeSequence
source: Invalid character escape sequence
de: Invalide Escapezeichen-Sequenz

# InvalidIndex
source: Array index must be an integer expression
de: Array-Index muss ein Integer-Ausdruck sein

source: Invalid initializer member declarator
de: Invalide Deklaration eines Member-Intialisierers

# InvalidIntegerLiteral
source: Invalid integer literal '{0}'
de: Invalides Integer-Literal '{0}'

# InvalidMethodCall
source: No applicable method exists in type '{0}'
de: Keine zutreffende Methode gefunden im Typ '{0}'

source: Invalid Operation
de: Invalide Operation

# InvalidRealLiteral
source: Invalid real literal '{0}'
de: Invalides Kommazahl-Literal '{0}'

# MethodTypeParametersCantBeInferred
source: The type arguments for method '{0}' cannot be inferred from the usage.
de: Die Argumenttypen für die Methode '{0}' kann nicht von ihrer Nutzung erschlossen werden.

# NeitherTypeConvertsToOther
source: Neither of the types '{0}' and '{1}' converts to the other
de: Keine der beiden Typen '{0}' und '{1}' kann zueinander konvertiert werden

# NoApplicableConstructor
source: No applicable constructor exists in type '{0}'
de: Kein zutreffender Konstruktor existiert im Typ '{0}'

# NoApplicableIndexer
source: No applicable indexer exists in type '{0}'
de: Kein zutreffender Indexer existiert im Typ '{0}'

# OpenCurlyBracketExpected
source: '{{' expected
de: '{{' erwartet

# OpenParenExpected
source: '(' expected
de: '(' erwartet

# ParamsArrayTypeNotAnArray
source: Params array type is not an array, element not found
de: Params Array Typ ist kein Array, Element nicht gefunden

source: Syntax error
de: Syntax Fehler

# TypeHasNoNullableForm
source: Type '{0}' has no nullable form
de: Typ '{0}' hat keine Nullable-Form

source: Type identifier expected
de: Typ-Bezeichner erwartet

# TypeofRequiresAType
source: The 'typeof' keyword requires a type as an argument
de: Das 'typeof'-Schlüsselwort benötigt einen Typen als Argument

# TypeofRequiresOneArg
source: The 'typeof' keyword requires 1 argument
de: Das 'typeof'-Schlüsselwort benötigt 1 Argument

# UnableToFindAppropriateAddMethod
source: The best overloaded Add method '{0}.Add' for the collection initializer has some invalid arguments
de: Die beste Überladung der Add-Methode '{0}.Add' für den Auflistungsinitialisierer hat invalide Argumente

# UnknownPropertyOrField
source: No property or field '{0}' exists in type '{1}'
de: Keine Eigenschaft oder Feld '{0}' existiert am Typ '{1}'

# UnsupportedMultidimensionalArrays
source: Multidimensional arrays are not supported
de: Mehrdimensionale Arrays werden nicht unterstützt

source: Unterminated string literal
de: Nicht-beendetes Zeichenfolgenliteral

# ReservedWord
source: {0} is a reserved word
de: {0} ist ein reserviertes Wort

# ArgumentCountMismatch
source: Arguments count mismatch
de: Argumentzahl unpassend

# GenericTypeReference
source: Generic type must be referenced via its generic definition: {0}
de: Generische Typen müssen mittels generischer Definition referenziert werden: {0}

# AssignmentOperatorNotAllowed
source: Assignment operator '{0}' not allowed
de: Zuweisungsoperator '{0}' ist nicht erlaubt

# DuplicateParameter
source: The parameter '{0}' was defined more than once
de: Der Parameter '{0}' wurde mehrmals definiert

# InvalidMethodCall2
source: No applicable method '{0}' exists in type '{1}'
de: Keine zutreffende Methode '{0}' gefunden im Typ '{1}'

# ReflectionNotAllowed
source: Reflection expression not allowed. To enable reflection use Interpreter.EnableReflection().
de: Spiegelungsausdrücke sind nicht erlaubt. Aktivieren Sie Spiegelung mittels Interpreter.EnableReflection().

# UnknownIdentifier
source: Unknown identifier '{0}'
de: Unbekannter Bezeichner '{0}'

# DuplicateLocalParameterDeclaration
source: A local or parameter named '{0}' cannot be declared in this scope because that name is used in an enclosing local scope to define a local or parameter
de: Eine locale Variable oder Parameter '{0}' kann nicht in dieser Zugriffsebene deklariert werden, da dieser Name bereits in einer höheren Zugriffsebene verwendet wird, um eine lokale Variable oder Parameter zu definieren

# MultipleLambdaParametersWithoutBrace
source: Multiple lambda parameters detected, but with no surrounding parenthesis
de: Mehrere Lambda-Funktionsparameter erkannt, aber keine umgebenden Klammern gegeben

# GenericArgumentCountMismatch
source: The number of generic arguments provided doesn't equal the arity of the generic type definition
de: Die Anzahl an Typargumenten für den generischen Typ stimmt nicht mit der Stelligkeit der Definition überein

# NextTokenAtEnd
source: NextToken called when already at the end of the expression
de: NextToken wurde am Ende des Ausdrucks aufgerufen
